#include "myKey.h"

#define KEY1 P36		//定义一个按键 引脚选择P36
#define KEY2 P37		//定义一个按键 引脚选择P37






u8 LED_Data = 0XFE;

void key_loop(void)
{

//	if( KEY1 == 0  )	//判断按键有没有按下
//	{
//		delay_ms(10);
//		if( KEY1 == 0 )
//		{
//			printf("按键P36已经按下\r\n");
//			P10 = 0;	//LED0点亮
//		}
//	}
//	else		//如果没有按下
//	{
//		P10 = 1;	//LED0点亮
//	}
//	if( KEY2 == 0  )	//判断按键有没有按下
//	{
//		delay_ms(10);
//		if( KEY2 == 0 )
//		{
//			printf("按键P37已经按下\r\n");
//			P17 = 1;	//LED熄灭
//		}
//	}
//	else
//	{
//		P17 = 0;	//LED熄灭
//	}		
//------------------------------------------------按下一次，状态取反	*/
		if( KEY1 == 0  )	//判断按键有没有按下
		{
			delay_ms(10);
			if( KEY1 == 0 )		//按键确实按下了
			{
				while(KEY1 == 0)		//如果按键一直是按下的，一直执行while
				{
					
				}
				printf("按键P36已经按下,led取反一次\r\n");
				P17 = !P17;	//LED熄灭				
			}
		}
		
//------------------------------------------------按下一次，灯网左边移动一个单位	------------------------------------------------		
		if( KEY2 == 0  )	//判断按键有没有按下
		{
			delay_ms(10);
			if( KEY2 == 0 )		//按键确实按下了
			{
				printf("按键P37已经按下,led左移一个\r\n");
				
				LED_Data = ( (LED_Data<<1) +1 );		//本来是直接输出P6，先计算，后输出
				
				if( LED_Data == 0XFF )
					LED_Data = 0xFE;
				
				P1 = LED_Data;
				while(KEY2 == 0);		//如果按键一直是按下的，一直执行while		
			}
		}			
}
